// 1. Напишите функцию (), которая в зависимости от переданных в нее целочисленных аргументов "количество дней", 
// будет выводить слово "день" в нужно форме ("если передали - 1, то 1 день", "если передали - 3, то 3 дня" и т.д). ++
// 2. Дано целое число n. Вычислите сумму его цифр. Использовать только рекурсию.

function NumberOfDays(days) {
	'use strict'
	if(days == 1){
		console.log(days + ' день')
	}else {
		console.log(days + ' дня');
	}
};

 NumberOfDays(1);


 function SummOfN(n) {
 	
 	function SummOfN(n) {
 		
 	}
 }


 SummOfN(24)